export interface quotationItem {
  content: string;
  date: string;
  source?: string;
  profession?: string;
}

export const quotationData: quotationItem[] = [
  {
    content: "他们的大学故事，始于一场初秋，终于一场盛夏。",
    date: "2023-10-31",
  },
  {
    content: "你的每一个行动，都是对你想成为怎样的人的投票。",
    date: "2023-10-31",
    source: "詹姆斯•克利尔（James Clear）",
    profession: "美国习惯研究专家",
  },
  {
    content: "简单比复杂更难，你必须努力让你的想法变得清晰明了，让它变得简单。",
    date: "2021-07-01",
    source: "乔布斯",
  },
  {
    content:
      "别人的好，是会逼着我去察觉我的长处在哪里的。你会很笃定地知道，没错我自卑，但是自卑是我的燃料，会让我去学习别人怎么去达成他的目标，我要怎么达成我的目标，这叫做——做自己。",
    date: "2021-06-13",
    source: "蔡康永",
  },
  {
    content:
      "微信不是一个工具，心理满足的驱动力远胜工具甚至省钱。我们让用户使用的驱动力确实不是来自这是一个工具，或者是省钱。如果把微信定位成比短信更省钱的工具，那么微信可能就失败了。工具的吸引力是不够的，所以，将微信定位成了：微信是一个生活方式。",
    date: "2021-05-12",
    source: "张小龙",
  },
  {
    content: "「四笔钱」，就是把我们用来投资的钱分成四笔：保险保障、活钱管理、稳健理财、长期投资。",
    date: "2021-05-05",
    source: "【有知有行App】 ",
  },
  {
    content: "意愿和本性会带你到属于你的地方。",
    date: "2021-04-26",
    source: "【有知有行App】",
  },
  {
    content: "只要慢慢走，正确的路一定会越走越远。",
    date: "2021-04-26",
    source: "【电影：实习生】",
  },
  {
    content:
      "我们曾如此渴望命运的波澜，到最后才发现：人生最曼妙的风景，竟是内心的淡定与从容……我们曾如此期盼外界的认可，到最后才知道：世界是自己的，与他人毫无关系。",
    date: "2021-04-12",
    source: "【一百岁感言】杨绛",
  },
  {
    content: "除非别人主动向你请教，否则，不要强行去说教别人，以希望别人改变。",
    date: "2021-03-31",
  },
  {
    content: "我要悄悄的努力，然后惊艳所有人。",
    date: "2021-03-25",
  },
  {
    content: "我们不能站在现在的高度去评判当年的自己这不公平，如果重来一次，以当年的阅历和心智也会做出同样的选择。",
    date: "2020-01-01",
  },
  {
    content: "这么年轻，升本+考验，同时软考。",
    date: "2020-01-01",
  },
  {
    content: "自律使我自由。",
    date: "2020-01-01",
  },
];
